
def area(a):
    '''
    Возвращает произведение числа a само на себя (площадь квадрата).

            Параметры:
                a - число со значением стороны квадрата

            Возвращаемое значение:
                Произведение числа a на само себя (площадь квадрата).
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает произведение числа 4 на a (периметр квадрата).

            Параметры:
                a - число со значением стороны квадрата.

            Возвращаемое значение:
                Произведение числа 4 на a (периметр квадрата).
    '''
    return 4 * a
