def area(a, b, c):
    '''
      Возвращает сумму трёх чисел разделённую на 2(площадь треугольника).

              Параметры:
                  a, b, c - три числа со значением сторон треугольника

              Возвращаемое значение:
                  Возвращает сумму трёх чисел( трёх сторон треугольника) разделённую на 2(площадь треугольника).

      '''
    return (a + b + c) / 2


def perimeter(a, b, c):
    '''
      Возвращает сумму трёх чисел(периметр треугольника).

              Параметры:
                  a, b, c - три числа со значением сторон треугольника

              Возвращаемое значение:
                  Возвращает сумму трёх чисел(трёх сторон треугольника) (периметр треугольника).

      '''
    return a + b + c
